import BaseAccordion from '../BaseAccordion.vue';
import BaseAccordionItem from '../BaseAccordionItem.vue';

const ITEMS = [
  {
    id: 1,
    title: 'Почему стоит изучать программирование?',
    description: `
      <p>Программирование — это одна из самых востребованных и динамично развивающихся областей на сегодняшний день. Почему же стоит уделить внимание изучению кодинга?</p>
      <p>Возможности для карьеры — навыки программирования открывают двери в различные индустрии, включая технологии, медицину и финансы. Гибкость — вы можете работать удаленно, а также создавать свои собственные проекты. Инструмент для решения проблем — изучая программирование, вы учитесь логическому мышлению и решению сложных задач.</p>
    `,
    button: {
      href: '#',
      label: 'Узнать больше',
    },
  },
  {
    id: 2,
    title: 'Как начать программировать?',
    description: `
      <h3>Вот несколько шагов для начала:</h3>
      <ol>
        <li>Выберите язык программирования, с которого начнёте. Популярные варианты для новичков включают Python, JavaScript и Ruby.</li>
        <li>Изучите основы синтаксиса и ключевых концепций, таких как циклы, условия и функции. Используйте онлайн-курсы и книги.</li>
        <li>Практикуйтесь — создавайте маленькие проекты или решайте задачи на платформах, таких как LeetCode или CodeWars.</li>
        <li>Изучите основы алгоритмов и структур данных для повышения эффективности вашего кода.</li>
        <li>Присоединитесь к сообществу программистов, участвуйте в форумах и мероприятиях для обмена опытом и знаниями.</li>
      </ol>
    `,
    button: {
      href: '#',
    },
  },
  {
    id: 3,
    title: 'Как долго занимает изучение программирования?',
    description: `
      <img src="https://gb.ru/blog/wp-content/uploads/2022/11/1-17.jpg.webp" width="300px" height="200px" alt="">
      <p>Время, которое потребуется для обучения программированию, зависит от начального уровня знаний и интенсивности занятий. Обычно для достижения начального уровня может понадобиться от 6 до 12 месяцев регулярного изучения.</p>
    `,
  },
];

const Template = args => ({
  components: {
    BaseAccordion,
    BaseAccordionItem,
  },
  setup() {
    return {
      args,
      items: ITEMS,
    };
  },
  template: `<BaseAccordion>
    <BaseAccordionItem
      v-for="item in items"
      :key="item.id"
      :title="item.title"
      :button="item.button"
    >
      <div v-html="item.description"></div>
    </BaseAccordionItem>
  </BaseAccordion>`,
});

export default {
  title: '🔵 Macro components/Accordion',
  component: BaseAccordion,

  parameters: {
    layout: 'fullscreen',
  },

  argTypes: {
    id: {
      control: 'text',
    },
    multiple: {
      control: 'boolean',
    },
  },

  args: {
    id: 'accordion',
    multiple: true,
  },
};

export const Overview = {
  render: Template.bind(),

  parameters: {
    design: {
      type: 'figma',
      url: '',
    },
  },
};
